{"name":"Terel","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Terel Phillips - an inquisitive","headerTaglineThree":"developer rooted in the","headerTaglineFour":"vibrant city of Toronto, Ontario.","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/TrendiStack"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/terel-phillips/"},{"id":"4","title":"Blog","link":"https://blog.chetanverma.com/"},{"id":"5","title":"Email","link":"mailto:terel.phillips23@gmail.com"}],"projects":[{"id":"1","title":"Gelato Gelato Pizzeria","description":"Web Design / Development","imageSrc":"https://bobward-image-bucket.s3.ca-central-1.amazonaws.com/ggp.png","url":"https://github.com/TrendiStack/ggp-next13"},{"id":"2","title":"Your Casa Concierge","description":"Web Design / Development","imageSrc":"https://bobward-image-bucket.s3.ca-central-1.amazonaws.com/ycc.png","url":"https://github.com/TrendiStack/yourcasaconcierge"},{"id":"3","title":"AVANT","description":"Web Design / Development","imageSrc":"https://bobward-image-bucket.s3.ca-central-1.amazonaws.com/avant.png","url":"https://github.com/TrendiStack/avant-fullstack"},{"id":"4","title":"Portfolio","description":"Web Design / Development","imageSrc":"https://bobward-image-bucket.s3.ca-central-1.amazonaws.com/portfolio.png","url":"https://www.terel-phillips.ca/"}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"Hello, I'm Terel B Phillips, a dedicated and versatile Software Engineer passionate about creating exceptional user experiences. With expertise in JavaScript (ES5 and ES6), React, and Next.js, I specialize in delivering high-quality, scalable solutions. From optimizing front-end structures to implementing seamless navigation and form validation, I consistently drive UI changes and contribute to the success of software engineering applications. With a strong command over developer tools and experience in Agile methodologies, I am well-equipped to deploy applications and ensure their robustness and scalability. I am always eager to take on new challenges and expand my skill set. Let's connect and discuss how I can deliver impactful solutions for your projects.","resume":{"tagline":"👋  I'm a software engineer, product designer.","description":"I have delivered world-class user experiences to millions of people. Well-versed with React, Javascript, and most of the Web frameworks.","experiences":[{"id":"1","dates":"Jun 2022 - Apr 2023","type":"Full Time","position":"Frontend Engineer at Chapter Two","bullets":"Developed front-end structure using modular, reusable React components and made final decisions for production-level UI changes, Adapted to project-driven environment, successfully meeting project manager criteria through adaptability to new challenges, Collaborated closely with QA team to address bugs and verify acceptance criteria prior to shipping to production, Actively synced with manager to receive feedback and improve skillset through upskilling and pair-programming sessions, Led the design of data and API endpoints to enable seamless frontend integration with backend, Successfully migrated legacy angular project to React 17, resulting in a 32% increase in customer conversion, driven by a decrease in average page responsiveness by 4 seconds through data-driven analysis and implementation"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"July 2020 - Present","type":"Full Time","position":"Freelance ","bullets":"Evaluated client requirements and created designs that aligned with their objectives, Scheduled meetings with clients to provide updates on project progress, Incorporated client feedback to enhance design quality, Developed new features and functionality for clients, Setup and managed Google business accounts, purchased and forwarded domains, and hosted and maintained client websites, Built lasting relationships with clients through exceptional service and support"}],"education":{"universityName":"York University","universityDate":"2018-2022","universityPara":"Bachelor of Science - BS"},"languages":["Javascript","HTML5","CSS"],"frameworks":["React","Next JS","Tailwind CSS","ExpressJS","Redux","Framer Motion","Node.js"],"others":["Figma","Vercel","AWS","Vite","Netlify","MongoDB","Firebase","MySQL","PostgreSQL"]}}